{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"arguments": {}, "trainable": true, "name": "lambda_1", "batch_input_shape": [null, 64, 64, 3], "output_shape": null, "output_shape_type": "raw", "function_type": "lambda", "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\btrain.py\u00da\b<lambda>\u00db\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "W_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "activity_regularizer": null, "name": "convolution2d_1", "nb_filter": 24, "subsample": [2, 2], "activation": "relu", "border_mode": "same", "trainable": true, "bias": true, "b_regularizer": null, "W_regularizer": null, "nb_col": 5, "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "strides": [1, 1], "name": "maxpooling2d_1", "dim_ordering": "tf", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "W_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "activity_regularizer": null, "name": "convolution2d_2", "nb_filter": 36, "subsample": [2, 2], "activation": "relu", "border_mode": "same", "trainable": true, "bias": true, "b_regularizer": null, "W_regularizer": null, "nb_col": 5, "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "same", "strides": [1, 1], "name": "maxpooling2d_2", "dim_ordering": "tf", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "W_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "activity_regularizer": null, "name": "convolution2d_3", "nb_filter": 48, "subsample": [2, 2], "activation": "relu", "border_mode": "same", "trainable": true, "bias": true, "b_regularizer": null, "W_regularizer": null, "nb_col": 5, "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "same", "strides": [1, 1], "name": "maxpooling2d_3", "dim_ordering": "tf", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "W_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "activity_regularizer": null, "name": "convolution2d_4", "nb_filter": 64, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "trainable": true, "bias": true, "b_regularizer": null, "W_regularizer": null, "nb_col": 3, "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "same", "strides": [1, 1], "name": "maxpooling2d_4", "dim_ordering": "tf", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "W_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "activity_regularizer": null, "name": "convolution2d_5", "nb_filter": 64, "subsample": [1, 1], "activation": "relu", "border_mode": "same", "trainable": true, "bias": true, "b_regularizer": null, "W_regularizer": null, "nb_col": 3, "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "same", "strides": [1, 1], "name": "maxpooling2d_5", "dim_ordering": "tf", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}}, {"class_name": "Dense", "config": {"input_dim": 4096, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_1", "b_constraint": null, "activation": "relu", "trainable": true, "bias": true, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "output_dim": 1164}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.2}}, {"class_name": "Dense", "config": {"input_dim": 1164, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_2", "b_constraint": null, "activation": "relu", "trainable": true, "bias": true, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "output_dim": 100}}, {"class_name": "Dense", "config": {"input_dim": 100, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_3", "b_constraint": null, "activation": "relu", "trainable": true, "bias": true, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "output_dim": 50}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.2}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "p": 0.2}}, {"class_name": "Dense", "config": {"input_dim": 50, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_4", "b_constraint": null, "activation": "relu", "trainable": true, "bias": true, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "output_dim": 10}}, {"class_name": "Dense", "config": {"input_dim": 10, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_5", "b_constraint": null, "activation": "linear", "trainable": true, "bias": true, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "output_dim": 1}}], "keras_version": "1.2.2"}